/*
*********************************************************************************************************
*	内核异常中断服务程序
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*	函 数 名: NMI_Handler
*	功能说明: 不可屏蔽中断服务程序。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void NMI_Handler(void)
{
}

/*
*********************************************************************************************************
*	函 数 名: HardFault_Handler
*	功能说明: 硬件故障中断服务程序。其他异常处理被关闭，而又发生了异常，则触发。
*			  执行异常处理时，发生了异常，则触发。复位时默认使能。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void hard_fault(unsigned int * hardfault_args)
{
#if 1
        static unsigned int stacked_r0;
        static unsigned int stacked_r1;
        static unsigned int stacked_r2;
        static unsigned int stacked_r3;
        static unsigned int stacked_r12;
        static unsigned int stacked_lr;
        static unsigned int stacked_pc;
        static unsigned int stacked_psr;
        static unsigned int SHCSR;
        static unsigned char MFSR;
        static unsigned char BFSR;       
        static unsigned short int UFSR;
        static unsigned int HFSR;
        static unsigned int DFSR;
        static unsigned int MMAR;
        static unsigned int BFAR;
        stacked_r0 = ((unsigned long) hardfault_args[0]);
        stacked_r1 = ((unsigned long) hardfault_args[1]);
        stacked_r2 = ((unsigned long) hardfault_args[2]);
        stacked_r3 = ((unsigned long) hardfault_args[3]);
        stacked_r12 = ((unsigned long) hardfault_args[4]);
        /*异常中断发生时，这个异常模式特定的物理R14,即lr被设置成该异常模式将要返回的地址*/
        stacked_lr = ((unsigned long) hardfault_args[5]);   		// 即为错误发生时前次执行语句
        stacked_pc = ((unsigned long) hardfault_args[6]);
        stacked_psr = ((unsigned long) hardfault_args[7]);
        SHCSR = (*((volatile unsigned long *)(0xE000ED24))); 		//系统Handler控制及状态寄存器
        MFSR = (*((volatile unsigned char *)(0xE000ED28)));			//存储器管理fault状态寄存器       
        BFSR = (*((volatile unsigned char *)(0xE000ED29)));			//总线fault状态寄存器       
        UFSR = (*((volatile unsigned short int *)(0xE000ED2A)));	//用法fault状态寄存器               
        HFSR = (*((volatile unsigned long *)(0xE000ED2C))); 		//硬fault状态寄存器                       
        DFSR = (*((volatile unsigned long *)(0xE000ED30)));			//调试fault状态寄存器
        MMAR = (*((volatile unsigned long *)(0xE000ED34)));			//存储管理地址寄存器
        BFAR = (*((volatile unsigned long *)(0xE000ED38)));			//总线fault地址寄存器
#endif

//		执行程序后，若发生内核错误，则程序会运行到最后的while(1)处。
//		此时观察相应的堆栈和故障寄存器值， stacked_lr即为故障发生时进入故障中断前pc的值，
//		在MDK软件调试状态下，假如stacked_lr的值为0x1A002D08，
//		在左下方的命令窗口输入“pc = 0x1A002D08”，回车，
//		即可定位发生错误的代码位置。

  /* 当硬件失效异常发生时进入死循环 */
  while (1)
  {
  }
}

/*
*********************************************************************************************************
*	函 数 名: MemManage_Handler
*	功能说明: 内存管理异常中断服务程序。违反MPU设定的存储器访问规则时触发。 复位时默认未使能
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void MemManage_Handler(void)
{
  /* 当内存管理异常发生时进入死循环 */
  while (1)
  {
  }
}

/*
*********************************************************************************************************
*	函 数 名: BusFault_Handler
*	功能说明: 总线访问异常中断服务程序。取指令、数据读写、堆栈操作出现异常。 复位时默认未使能
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void BusFault_Handler(void)
{
  /* 当总线异常时进入死循环 */
  while (1)
  {
  }
}

/*
*********************************************************************************************************
*	函 数 名: UsageFault_Handler
*	功能说明: 用法错误中断服务程序。执行未定义指令、非对齐操作、除零时触发。 复位时默认未使能
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void UsageFault_Handler(void)
{
  /* 当用法异常时进入死循环 */
  while (1)
  {
  }
}

/*
*********************************************************************************************************
*	函 数 名: SVC_Handler
*	功能说明: 通过SWI指令的系统服务调用中断服务程序。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void SVC_Handler(void)
{
}

/*
*********************************************************************************************************
*	函 数 名: DebugMon_Handler
*	功能说明: 调试监视器中断服务程序。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void DebugMon_Handler(void)
{
}

/*
*********************************************************************************************************
*	函 数 名: PendSV_Handler
*	功能说明: 可挂起的系统服务调用中断服务程序。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void PendSV_Handler(void)
{
}
